v2206/atmospheric_Microclimate/actuator/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-12;

boundaryField
{
    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

    upperAtm
    {
        type            calculated;
        value           $internalField;
        
    }

    ground
    {
        type            nutkRoughWallFunction;
        Cmu             0.09;
        kappa           0.40;
        E               9.8;
        Cs              uniform 0.5;
        Ks              uniform 2.2;

        value           $internalField;
    }

    frontAtm
    {
        type            cyclic;
    }

    backAtm
    {
        type            cyclic;
    }
}


// ************************************************************************* //
