v2206/atmospheric_Microclimate/actuator/system/blockMeshDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale   1;



// main box
Lmin   -300;
Hmin   0;
Wmin   -270;

Lmax   220;
Hmax   100;
Wmax   120;



vertices
(
    ($Wmin     $Hmin   $Lmin) // v0
    ($Wmax     $Hmin   $Lmin) // v1 
    ($Wmax     $Hmax   $Lmin) // v2
    ($Wmin     $Hmax   $Lmin) // v3

    ($Wmin     $Hmin   $Lmax) // v4
    ($Wmax     $Hmin   $Lmax) // v5
    ($Wmax     $Hmax   $Lmax) // v6
    ($Wmin     $Hmax   $Lmax) // v7
);


blocks
(
    hex (0 1 2 3 4 5 6 7)
    (32 32 64)
    simpleGrading 
    (
        1 
        (
        //   dist   nCell  rate
            (0.15   0.30   10)
            (0.85   0.70   1)
        )
        1
    )
);


edges
(
);


boundary
(
    inlet
    {
        // type patch;
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        // type patch;
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (1 2 6 5)
        );
    }
    upperAtm
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
    frontAtm
    {
        type cyclic;
        neighbourPatch backAtm;
        // type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    backAtm
    {
        type cyclic;
        neighbourPatch frontAtm;
        // type patch;
        faces
        (
            (0 1 2 3)
        );
    }
);


// ************************************************************************* //
