v2206/atmospheric_Microclimate/actuator/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version 	2.0;
	format		ascii;
	class 		dictionary;
	location	"system";
	object 		fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type    		meanVelocityForce;
    active  		yes;
    selectionMode   all;
    fields          (U);
    Ubar            (3 0 0);
    relaxation		0.9;
}

dragSource1
{
    type            actuationDiskSource;
    selectionMode   cellSet;
    cellSet         dragSource1;
    Cp              0.53;
    Ct              0.58;
    diskArea        40;
    diskDir         (1 0 0);  // Or other Function1
    upstreamPoint   (45 40 125);
}